import pandas as pd
import numpy as np

date = pd.date_range('20130101', periods=6)  # 生成行index
df = pd.DataFrame(np.arange(24).reshape(6, 4), index=date, columns=['A', 'B', 'C', 'D'])
                        #              A   B   C   D
                        # 2013-01-01   0   1   2   3
                        # 2013-01-02   4   5   6   7
                        # 2013-01-03   8   9  10  11
                        # 2013-01-04  12  13  14  15
                        # 2013-01-05  16  17  18  19
                        # 2013-01-06  20  21  22  23
# ——————————————————————————————————------——选择数据————————————————————————————————————————————————
# print(df['A'])  #打印A列
                        # 2013-01-01     0
                        # 2013-01-02     4
                        # 2013-01-03     8
                        # 2013-01-04    12
                        # 2013-01-05    16
                        # 2013-01-06    20
                        # Freq: D, Name: A, dtype: int32
# print(df[0:3])    # 输出0-3行的数据
                        #             A  B   C   D
                        # 2013-01-01  0  1   2   3
                        # 2013-01-02  4  5   6   7
                        # 2013-01-03  8  9  10  11

# loc 运用标签的方式来选择，例如 df.loc[行标签，列标签]
# print(df.loc['2013-01-01',['A','B']])  #行选择 2013-01-01 ，列选择A B

# iloc 运用索引的方式来切片
# print(df.iloc[3:5,1:3])

# -------------------------------------------设置值与索引-----------------------------------------------------------------

# 用索引方式修改数值
# df.iloc[2,2]=50
# print(df)


# 设置新的索引
# df.index = [……]


# df.reindex=[……]  会讲新增的原本没有数据的一列设置为NaN值

# set_index  如果第二个参数 drop = False，则这一列并不会被删掉
# print(df.set_index('A')) # 将某一列变成了索引
                                    #      B   C   D
                                    # A
                                    # 0    1   2   3
                                    # 4    5   6   7
                                    # 8    9  10  11
                                    # 12  13  14  15
                                    # 16  17  18  19
                                    # 20  21  22  23


print(df.set_index(['A','B'])) # 设置两个索引的时候会产生multi_index
                                    #         C   D
                                    # A  B
                                    # 0  1    2   3
                                    # 4  5    6   7
                                    # 8  9   10  11
                                    # 12 13  14  15
                                    # 16 17  18  19
                                    # 20 21  22  23


# 增加一个空列
# df['E'] = np.nan
# print(df)
#              A   B   C   D   E
# 2013-01-01   0   1   2   3 NaN
# 2013-01-02   4   5   6   7 NaN
# 2013-01-03   8   9  10  11 NaN
# 2013-01-04  12  13  14  15 NaN
# 2013-01-05  16  17  18  19 NaN
# 2013-01-06  20  21  22  23 NaN

# 增加一个有数值的列 ，运用新增Series的方法
# df['E'] = pd.Series([1,2,3,4,5,6],index=pd.date_range('20130101',periods=6))
# print(df)
#              A   B   C   D  E
# 2013-01-01   0   1   2   3  1
# 2013-01-02   4   5   6   7  2
# 2013-01-03   8   9  10  11  3
# 2013-01-04  12  13  14  15  4
# 2013-01-05  16  17  18  19  5
# 2013-01-06  20  21  22  23  6


