import pandas as pd
import numpy as np

# pd.read_csv('绝对路径') 来读取数据
# pd.to_pickle('路径') 来储存数据

# -------------------------------------concat合并-------------------------------------------

df1 = pd.DataFrame(np.ones((3,4))*0,columns=['a','b','c','d'])
df2 = pd.DataFrame(np.ones((3,4))*1,columns=['a','b','c','d'])
df3 = pd.DataFrame(np.ones((3,4))*2,columns=['a','b','c','d'])
                                # df1
                                #      a    b    c    d
                                # 0  0.0  0.0  0.0  0.0
                                # 1  0.0  0.0  0.0  0.0
                                # 2  0.0  0.0  0.0  0.0
                                    # df2
                                    #      a    b    c    d
                                    # 0  1.0  1.0  1.0  1.0
                                    # 1  1.0  1.0  1.0  1.0
                                    # 2  1.0  1.0  1.0  1.0
                                        # df3
                                        #      a    b    c    d
                                        # 0  2.0  2.0  2.0  2.0
                                        # 1  2.0  2.0  2.0  2.0
                                        # 2  2.0  2.0  2.0  2.0




# res = pd.concat([df1,df2,df3],axis=0) # vertical合并
# print(res)
                                #      a    b    c    d
                                # 0  0.0  0.0  0.0  0.0
                                # 1  0.0  0.0  0.0  0.0
                                # 2  0.0  0.0  0.0  0.0
                                # 0  1.0  1.0  1.0  1.0
                                # 1  1.0  1.0  1.0  1.0
                                # 2  1.0  1.0  1.0  1.0
                                # 0  2.0  2.0  2.0  2.0
                                # 1  2.0  2.0  2.0  2.0
                                # 2  2.0  2.0  2.0  2.0




# res = pd.concat([df1,df2,df3],axis=0,ignore_index=True) # 忽略原来的index，重新排列
# print(res)
                                #      a    b    c    d
                                # 0  0.0  0.0  0.0  0.0
                                # 1  0.0  0.0  0.0  0.0
                                # 2  0.0  0.0  0.0  0.0
                                # 3  1.0  1.0  1.0  1.0
                                # 4  1.0  1.0  1.0  1.0
                                # 5  1.0  1.0  1.0  1.0
                                # 6  2.0  2.0  2.0  2.0
                                # 7  2.0  2.0  2.0  2.0
                                # 8  2.0  2.0  2.0  2.0
# ---------------------------------JOIN功能 -------------------------------------------------------

df1 = pd.DataFrame(np.ones((3,4))*0,index=[1,2,3],columns=['a','b','c','d'])
                                #      a    b    c    d
                                # 1  0.0  0.0  0.0  0.0
                                # 2  0.0  0.0  0.0  0.0
                                # 3  0.0  0.0  0.0  0.0
df2 = pd.DataFrame(np.ones((3,4))*1,index=[2,3,4],columns=['b','c','d','e'])
                                #      b    c    d    e
                                # 2  1.0  1.0  1.0  1.0
                                # 3  1.0  1.0  1.0  1.0
                                # 4  1.0  1.0  1.0  1.0


# res = pd.concat([df1,df2])   # 默认是 join = 'outer'
                                #      a    b    c    d    e
                                # 1  0.0  0.0  0.0  0.0  NaN
                                # 2  0.0  0.0  0.0  0.0  NaN
                                # 3  0.0  0.0  0.0  0.0  NaN
                                # 2  NaN  1.0  1.0  1.0  1.0
                                # 3  NaN  1.0  1.0  1.0  1.0
                                # 4  NaN  1.0  1.0  1.0  1.0

# res = pd.concat([df1,df2], join='inner')   # inner join 只保留具有相同的部分
                                #      b    c    d
                                # 1  0.0  0.0  0.0
                                # 2  0.0  0.0  0.0
                                # 3  0.0  0.0  0.0
                                # 2  1.0  1.0  1.0
                                # 3  1.0  1.0  1.0
                                # 4  1.0  1.0  1.0

# res = df1.append(df2,ignore_index=True) # 在vertical方向加数据
                                #      a    b    c    d    e
                                # 0  0.0  0.0  0.0  0.0  NaN
                                # 1  0.0  0.0  0.0  0.0  NaN
                                # 2  0.0  0.0  0.0  0.0  NaN
                                # 3  NaN  1.0  1.0  1.0  1.0
                                # 4  NaN  1.0  1.0  1.0  1.0
                                # 5  NaN  1.0  1.0  1.0  1.0
# s1 = pd.Series([1,2,3,4],index=['a','b','c','d'])
# res = df1.append(s1,ignore_index=True)
# print(res)   #在vertical方向增加一行数据
                                #      a    b    c    d
                                # 0  0.0  0.0  0.0  0.0
                                # 1  0.0  0.0  0.0  0.0
                                # 2  0.0  0.0  0.0  0.0
                                # 3  1.0  2.0  3.0  4.0





